INSERT INTO `allgr_infos` (`ALLGR_code`, `name`, `standart_description`, `ise_description`, `achievment_scale`, `expected_achievement_scale`, `GR_ALLGR_rest_weight`) VALUES
('gr_1', 'GR1', '', '具备较完整的软件工程知识结构，能够将数学、自然科学、专业知识用于解决复杂软件系统问题', 0.00, 0.00, 0.00),
('gr_10', 'GR10', '', '能够就复杂软件工程问题与业界同行及社会公众进行有效沟通和交流，包括撰写报告和设计文稿、陈述发言、清晰表达或回应指令。并具备一定的国际视野，能够在跨文化背景下进行沟通和交流', 0.00, 0.00, 0.00),
('gr_11', 'GR11', '', '具有实际的软件工程项目工作经验及组织管理能力，理解并掌握工程管理原理与经济决策方法，并能跨行业应用', 0.00, 0.00, 0.00),
('gr_12', 'GR12', '', '具有自主学习和终身学习的意识，有不断学习和适应发展的能力', 0.00, 0.00, 0.00),
('gr_2', 'GR2', '', '能够应用数学、自然科学和工程科学的基本原理，通过文献研究和系统建模，分析复杂软件系统问题，以获得有效结论', 0.00, 0.00,0.00),
('gr_3', 'GR3', '', '能够针对复杂软件工程问题，提出满足需求的总体设计和详细设计方案，并能够在设计环节中体现创新意识，考虑社会、健康、安全、法律、文化以及环境等因素', 0.00, 0.00,0.00),
('gr_4', 'GR4', '', '能够基于算法原理并采用科学方法对复杂软件工程问题进行研究，设计实验方案，分析与解释数据，并通过信息综合得到合理有效的结论', 0.00, 0.00, 0.00),
('gr_5', 'GR5', '', '能够针对复杂软件系统，选择与使用合适的开发环境、工具与技术标准，进行模拟和测试，并对输出结果进行分析，得出相应的评估结论', 0.00, 0.00,0.00),
('gr_6', 'GR6', '', '了解一个以上的软件工程应用领域相关技术和背景，能够基于软件工程相关背景知识进行合理分析，评价复杂软件工程对社会、健康、安全、法律以及文化的影响，并理解应承担的责任', 0.00, 0.00,0.00),
('gr_7', 'GR7', '', '能够理解和评价针对软件工程及其相关领域的复杂工程问题对环境、社会可持续发展的影响', 0.00, 0.00,0.00),
('gr_8', 'GR8', '', '具有人文社会科学素养、社会责任感，能够在工程实践中理解并遵守软件行业职业道德和规范，履行责任', 0.00, 0.00, 0.00),
('gr_9', 'GR9', '', '参与团队工程项目训练，能够在多学科背景下的团队中承担个体、团队成员以及负责人的角色', 0.00, 0.00, 0.00);
