
--
-- 转存表中的数据 `gr_infos`
--

INSERT INTO `gr_infos` (`gr_code`, `name`, `standart_description`, `ise_description`, `achievment_scale`, `expected_achievement_scale`, `gr_ALLGR_weight`, `CO_GR_rest_weight`, `ccp_GR_rest_weight`) VALUES

('gr_1_1', 'GR1.1', '', '掌握数学与自然科学知识，能将其应用于复杂软件工程问题的建模和求解', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_1_2', 'GR1.2', '', '掌握软件工程、计算机及相关的基础知识，能将其应用于软件工程中的系统架构、网络通信、支撑平台等问题', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_1_3', 'GR1.3', '', '理解系统的概念及其在软件工程领域的体现，能对复杂软件工程问题的解决方案进行分析，并尝试改进', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_1_4', 'GR1.4', '', '掌握专业知识，能选择恰当的数学模型，能用于描述复杂软件系统，对模型进行推理和求解', 0.00, 0.00, 0.00, 0.00, 0.00),

('gr_10_1', 'GR10.1', '', '能够撰写报告和设计文稿，清晰阐述复杂软件工程问题', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_10_2', 'GR10.2', '', '能够进行陈述发言，清楚表达对复杂软件工程问题的看法与见解', 0.00, 0.00,0.00, 0.00, 0.00),
('gr_10_3', 'GR10.3', '', '掌握至少一门外语，能够在跨文化背景下进行沟通和交流', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_10_4', 'GR10.4', '', '了解软件工程领域国际发展前沿状况，能够就本专业热点问题表达自己的想法', 0.00, 0.00, 0.00, 0.00, 0.00),

('gr_11_1', 'GR11.1', '', '具有校外工程实习的经历，并实际参与软件工程项目工作', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_11_2', 'GR11.2', '', '熟悉软件工程项目过程，理解工程管理原理与经济决策方法', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_11_3', 'GR11.3', '', ' 能够在不同领域综合应用工程管理原理和经济决策方法', 0.00, 0.00, 0.00, 0.00, 0.00),

('gr_12_1', 'GR12.1', '', '能够认识不断学习的重要性和必要性，具有自主学习和终身学习的意识', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_12_2', 'GR12.2', '', '掌握自主学习的方法，了解拓展知识和能力的途径', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_12_3', 'GR12.3', '', '能够针对个人或职业发展的需求，采用合适的方法，自主学习，适应发展', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_12_4', 'GR12.4', '', '掌握体育锻炼与运动的基本方法，为不断学习提供保障', 0.00, 0.00, 0.00, 0.00, 0.00),

('gr_2_1', 'GR2.1', '', '能识别和判断复杂软件工程问题的关键环节和参数', 0.00, 0.00,0.00, 0.00, 0.00),
('gr_2_2', 'GR2.2', '', '能认识到解决问题有多种方案可选择', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_2_3', 'GR2.3', '', '能分析文献寻求可替代的解决方案', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_2_4', 'GR2.4', '', '能正确表达一个工程问题的解决方案，并证实方案的合理性', 0.00, 0.00, 0.00, 0.00, 0.00),

('gr_3_1', 'GR3.1', '', '能够根据用户需求确定设计目标', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_3_2', 'GR3.2', '', '能够在安全、环境、法律等约束条件下，通过技术经济评价对设计方案的可行性进行研究', 0.00, 0.00,0.00, 0.00, 0.00),
('gr_3_3', 'GR3.3', '', '能够针对复杂软件工程问题，设计满足特定需求的总体设计和详细设计', 0.00, 0.00,0.00, 0.00, 0.00),
('gr_3_4', 'GR3.4', '', '能够集成单元过程进行软件系统流程设计，对流程设计方案进行优选，体现创新意识', 0.00, 0.00,0.00, 0.00, 0.00),

('gr_4_1', 'GR4.1', '', '能够采用科学的方法对软件系统中的关键环节，设计相应的实验方案，搭建实验环境，开展实验', 0.00, 0.00,0.00, 0.00, 0.00),
('gr_4_2', 'GR4.2', '', '能够对实现结果进行分析和解释，并通过信息综合得到合理有效的结论', 0.00, 0.00, 0.00, 0.00, 0.00),

('gr_5_1', 'GR5.1', '', '掌握获取技术、资源、现代工程工具和信息技术工具的能力', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_5_2', 'GR5.2', '', '能够根据软件系统的应用场景，选择合适的开发环境、工具与技术标准进行软件系统的开发', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_5_3', 'GR5.3', '', '选择相应的技术工具，针对软件工程及相关领域的复杂工程问题，进行预测和模拟', 0.00, 0.00, 0.00, 0.00, 0.00),

('gr_6_1', 'GR6.1', '', '掌握至少一个应用领域中软件工程技术的应用方法和应用实践', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_6_2', 'GR6.2', '', '能够识别复杂软件工程的解决方案对社会、健康、安全、法律以及文化的影响', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_6_3', 'GR6.3', '', '能够评价复杂软件工程的解决方案对社会、健康、安全、法律以及文化的影响，并理解应承担的责任', 0.00, 0.00, 0.00, 0.00, 0.00),

('gr_7_1', 'GR7.1', '', '能够理解软件工程实践对环境和社会可持续发展的影响', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_7_2', 'GR7.2', '', '能够评价软件工程实践对环境和社会可持续发展的影响', 0.00, 0.00, 0.00, 0.00, 0.00),

('gr_8_1', 'GR8.1', '', '尊重生命、关爱他人、诚信守则，具有人文知识、思辨能力、处事能力和科学精神', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_8_2', 'GR8.2', '', '理解社会主义核心价值观，具有推动民族复兴和社会进步的责任感', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_8_3', 'GR8.3', '', '具有软件工程系统的质量、环境、职业健康、安全和服务意识，理解并遵守职业道德和规范', 0.00, 0.00, 0.00, 0.00, 0.00),

('gr_9_1', 'GR9.1', '', '能够与其他学科的成员合作并开展工作', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_9_2', 'GR9.2', '', '能够独立完成团队分配的工作，并能胜任团队成员角色，承担相应责任', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_9_3', 'GR9.3', '', '能够与团队其他成员有效沟通，听取反馈意见，并综合团队成员的意见，进行合理决策', 0.00, 0.00, 0.00, 0.00, 0.00),
('gr_9_4', 'GR9.4', '', '具有良好的心理素质和应对突发事件、项目风险与挑战的能力', 0.00, 0.00, 0.00, 0.00, 0.00);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `gr_infos`
--
ALTER TABLE `gr_infos`
 ADD PRIMARY KEY (`gr_code`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
